package org.example.lesson2

fun main() {
    val okay = 3.00
    val good = 4.00
    val excellent = 5.00
    val students = 4
    val average = (2 * okay + good + excellent) / students

    println(average)
}
/*Задача на среднее арифметическое. В классе с углубленным изучением
английского языка учится 4 человека. У них следующие баллы по профильному
предмету 3, 4, 3, 5. Пишем часть школьного софта, который посчитает средний балл
по английскому для этого класса.

– Написать выражение, которое высчитывает средний балл;
– Распечатать результат в консоль;
– В консоли должно быть выведено дробное число с 2 знаками после запятой.*/