package org.example.lesson_1

fun main(){
    val numberOfOrders: Int = 75
    val thanksMessage: String = "Спасибо за покупку!"
    println("Было совершено $numberOfOrders заказов.")
    println(thanksMessage)
}
/* Представим, что у интернет-магазина было 75 заказов.
Нужно продумать релевантные названия и корректно объявить 2 переменные,
которые будут содержать:
– количество заказов,
– текст с благодарностью за покупку (текст на твое усмотрение).

Задай “говорящие” наименования переменных.
Названия переменных должны состоять из нескольких слов.
Тип переменных указывать принудительно. */