package org.example.lesson2

fun main() {
    val a = 3.00
    val b = 4.00
    val c = 5.00
    val middle = (a + a + b + c) / 4
    println(middle)
}
/*Задача на среднее арифметическое. В классе с углубленным изучением
английского языка учится 4 человека. У них следующие баллы по профильному
предмету 3, 4, 3, 5. Пишем часть школьного софта, который посчитает средний балл
по английскому для этого класса.

– Написать выражение, которое высчитывает средний балл;
– Распечатать результат в консоль;
– В консоли должно быть выведено дробное число с 2 знаками после запятой.*/